[
  {
    "name": "Degrading Metal",
    "schools": ["purple"],
    "base_cost": [
      {
        "school": "purple",
        "amount": 1
      }
    ],
    "extra_cost": [
      {
        "school": "black",
        "amount": 2
      }
    ],
    "range": 60,
    "duration": "1 hour",
    "synopsis": "You curse the armour or weapon of a creature within range. For the duration, a cursed weapon has -1 to damage and attack rolls made with it; a cursed armour has -2 to its AC.\n\nFor each Purple point spent after 1, damage and attack rolls are decreased by 1.\nFor each Purple point spent after 1, armour AC is decreased by 1.\nSpend 2 Black points to affect both armour and weapon."
  },
  {
    "name": "Revealing Light",
    "schools": ["purple"],
    "base_cost": [
      {
        "school": "purple",
        "amount": 2
      }
    ],
    "range": 60,
    "duration": "1 hour",
    "synopsis": "You create a source of dim light on the point you choose within range. For the duration, the light illuminates a 30 feet radius, and any creature that the light touches is semi-transparent and can be targeted for attacks as if they were visible. All attack rolls made to creatures that the light touches gains Disadvantage. A creature with Greater Invisibility cast on them is not affected.\n\nFor each Purple point spent after 2, affected area is increased by 5 feet."
  },
  {
    "name": "Counterspell",
    "schools": ["purple"],
    "base_cost": [
      {
        "school": "purple",
        "amount": 3
      }
    ],
    "range": 120,
    "duration": "Instantaneous",
    "synopsis": "You target a spell that is about to be cast, and attempt to counter it. If the target spell is 3 points or less, you counter it immediately. Otherwise, you need to use extra soul shards of either Purple, or the same colored shard of the targeted spell, to match the cost of the targeted spell."
  },
  {
    "name": "Creeping Fire",
    "schools": ["red", "green"],
    "base_cost": [
      {
        "school": "red",
        "amount": 1
      },
      {
        "school": "green",
        "amount": 1
      }
    ],
    "extra_cost": [
      {
        "school": "red",
        "amount": 1
      },
      {
        "school": "green",
        "amount": 1
      }
    ],
    "range": 60,
    "duration": "18 seconds (minimum)",
    "synopsis": "A fire starts spreading from the point you choose within range to two more squares. The fire spreads to a square after each creature's turn.\n\nFor each red point spent after 1, the fire spreads 1 square faster each turn.\nFor each green point spent after 1, the amount of square the fire is going to spread increased by 1."
  },
  {
    "name": "Accelerate",
    "schools": ["red"],
    "base_cost": [
      {
        "school": "red",
        "amount": 2
      }
    ],
    "extra_cost": [
      {
        "school": "red",
        "amount": 1
      }
    ],
    "range": "Self",
    "duration": "Instantaneous",
    "synopsis": "You get an extra action this round. If you attack with that action, add 1d6 of damage to a single attack.\n\nFor each red point spent after 2, add an extra 1d6 of damage."
  },
  {
    "name": "Thorns of Haste",
    "schools": ["red", "green"],
    "base_cost": [
      {
        "school": "red",
        "amount": 2
      },
      {
        "school": "green",
        "amount": 1
      }
    ],
    "range": 60,
    "duration": "Instantaneous",
    "synopsis": "Choose a target within range. Thorny vines rush towards the target from beneath your feet, clearing any harsh terrain along the way, and emerging from beneath the target. The target makes a Dexterity saving throw and takes 2d8 pierce damage and gets entangled on a fail. Half as much damage on a success."
  },
  {
    "name": "Imperfect Invisibility",
    "schools": ["purple"],
    "base_cost": [
      {
        "school": "purple",
        "amount": 0
      }
    ],
    "extra_cost": [
      {
        "school": "purple",
        "amount": 4
      }
    ],
    "range": "Self",
    "duration": "30 minutes",
    "synopsis": "You turn yourself invisible for the duration. Anything you are wearing or holding stays visible.\n\nSpend 4 Purple shards to turn the spell into a normal invisiblity spell."
  },
  {
    "name": "Life Vortex",
    "schools": ["black"],
    "base_cost": [
      {
        "school": "black",
        "amount": 3
      }
    ],
    "extra_cost": [
      {
        "school": "black",
        "amount": 3
      }
    ],
    "range": 10,
    "duration": "Instantaneous",
    "synopsis": "You create a dark vortex that sucks up all life energy around the caster. All creatures within range, including the caster, has to make a Constitution saving throw and lose 2d4 worth of hit points if they fail. The caster gains temporary hit points equal to the damage dealt. A creature cannot be killed by this spell. If a creature does not have enough hit points, they drop to 1 hit point instead, and the caster receives what hit point they could steal.\n\nFor each Black points spent after 3, damage is increased by 1d4.\nFor each Black points spent after 3, range is increased by 5 feet."
  },
  {
    "name": "Sever the Bloodline",
    "schools": ["black"],
    "base_cost": [
      {
        "school": "black",
        "amount": 4
      }
    ],
    "extra_cost": [
      {
        "school": "black",
        "amount": 1
      }
    ],
    "range": 60,
    "duration": "Instantaneous",
    "synopsis": "Choose a kin. All creatures within range from the choosen kin have to make a Constitution saving throw and receive 2d12 + 10 damage on a fail.\n\nFor each Black points spent after 4, add another 1d12."
  },
  {
    "name": "Healing Hand",
    "schools": ["green"],
    "base_cost": [
      {
        "school": "green",
        "amount": 1
      }
    ],
    "extra_cost": [
      {
        "school": "green",
        "amount": 1
      },
      {
        "school": "white",
        "amount": 1
      }
    ],
    "range": 5,
    "duration": "Instantaneous",
    "synopsis": "You touch a creature within range, and heal them for 1d4 + 2.\n\nFor each Green point spent after 1, healing is increased by 1d4.\nSpend 1 White point to target another creature."
  },
  {
    "name": "Changing Winds",
    "schools": ["green"],
    "base_cost": [
      {
        "school": "green",
        "amount": 2
      }
    ],
    "extra_cost": [
      {
        "school": "green",
        "amount": 1
      }
    ],
    "range": 60,
    "duration": "Instantaneous",
    "synopsis": "You target a creature within range. The creature has to make a Dexterity saving throw and be pulled or pushed 10 feet on a fail.\nIf the season is summer, target takes 4d4 fire damage.\nIf the season is winter, the target is stunned and takes 1d6 cold damage.\nIf the season is spring, the target is healed 2d6.\nIf the season is autumn, the creature is pushed or pulled another 10 feets, and takes 1d8 lightning damage.\n\nFor each Green point spent after 1, add 1 additional die according to the seasons."
  },
  {
    "name": "Pomegrenade",
    "schools": ["green"],
    "base_cost": [
      {
        "school": "green",
        "amount": 1
      }
    ],
    "extra_cost": [
      {
        "school": "green",
        "amount": 1
      }
    ],
    "range": 60,
    "duration": "Instantaneous",
    "synopsis": "You throw a pomegranate to a square within range. The pomogranate explodes, dealing 2d6 nature damage to any creature in the square, and 1d4 nature damage to all adjacent squares. Any creatures in the target square have to make a Dexterity saving throw, and take half as damage on a success."
  },
  {
    "name": "Divine Favour",
    "schools": ["white"],
    "base_cost": [
      {
        "school": "white",
        "amount": 3
      }
    ],
    "extra_cost": [
      {
        "school": "white",
        "amount": 1
      },
      {
        "school": "white",
        "amount": 2
      }
    ],
    "range": 5,
    "duration": "1 hour",
    "synopsis": "You touch two willing creatures. For the duration, the creatures get +1 to their damage and attack rolls made with weapons. Alternatively, they get +2 to their AC.\n\nFor each White point spent after 3, add +1 to damage and attack rolls OR +2 to AC.\nFor every 2 White points spent after 3, target one more creature."
  },
  {
    "name": "Guiding Blow",
    "schools": ["white"],
    "base_cost": [
      {
        "school": "white",
        "amount": 1
      }
    ],
    "extra_cost": [
      {
        "school": "white",
        "amount": 1
      }
    ],
    "range": "Self",
    "duration": "1 hour",
    "synopsis": "You enhance your weapon with light. The next time you attack a creature with that weapon and hit, you and your allies gain advantage on attack rolls made against that creature on the following turn. All allies add +2 to their damage rolls when attacking that creature.\n\nFor each White point spent after 1, add +1 to attack and damage rolls made agains that creature by your allies."
  },
  {
    "name": "Conversion",
    "schools": ["purple"],
    "base_cost": [
      {
        "school": "purple",
        "amount": 2
      }
    ],
    "extra_cost": [
      {
        "school": "purple",
        "amount": 2
      }
    ],
    "duration": "Instantaneous",
    "range": "Self",
    "synopsis": "You convert the mana inside of you to another color. Gain 1 temporary mana from any color you wish. This mana lasts until a short or long rest, or until it is used.\n\nFor every 2 Purple points spent after 2, gain one additional mana of your choosing."
  }
]